/**
 *
 */
package org.quiteoldorange.i3textutils.formsdecompiler.decompilationunit;

import org.quiteoldorange.i3textutils.formsdecompiler.DecompilationContext;

import com._1c.g5.v8.dt.form.model.FormField;

/**
 * @author ozolotarev
 *
 */
public class FormFieldUnit
    extends FormItemUnit
{

    /**
     * @param formgroup
     * @param item
     */
    public FormFieldUnit(FormField item)
    {
        super(FormItemUnit.ItemTypes.FormField, item);

        mName = item.getName();
        mType = item.getType();
        mVerticalAlign = item.getGroupVerticalAlign();
        mHorizontalAlign = item.getGroupHorizontalAlign();

        mTitles = item.getTitle();
        mTooltip = item.getToolTip();

        mTitleLocation = item.getTitleLocation();
        mDataPath = item.getDataPath();
        mFooterDataPath = item.getFooterDataPath();
    }

    @Override
    public void decompile(StringBuilder b, DecompilationContext context)
    {
//        СтруктураКопируемыхСвойств.Вставить("Вид");
//        СтруктураКопируемыхСвойств.Вставить("ВертикальноеПоложение",ВертикальноеПоложениеЭлемента.Авто);
//        СтруктураКопируемыхСвойств.Вставить("ГоризонтальноеПоложение",ГоризонтальноеПоложениеЭлемента.Авто);
//        СтруктураКопируемыхСвойств.Вставить("Заголовок","");
//        СтруктураКопируемыхСвойств.Вставить("Подсказка","");
//        СтруктураКопируемыхСвойств.Вставить("ПоложениеЗаголовка",ПоложениеЗаголовкаЭлементаФормы.Авто);
//        СтруктураКопируемыхСвойств.Вставить("ПутьКДанным","");       //Определяется в "ДанныеЭлементов"
//        СтруктураКопируемыхСвойств.Вставить("ПутьКДаннымПодвала","");    //Определяется в "ДанныеЭлементов"
//        СтруктураКопируемыхСвойств.Вставить("ЦветТекстаЗаголовка",Новый Цвет());
//        СтруктураКопируемыхСвойств.Вставить("ЦветТекстаПодвала",Новый Цвет());
//        СтруктураКопируемыхСвойств.Вставить("ЦветФонаЗаголовка",Новый Цвет());
//        СтруктураКопируемыхСвойств.Вставить("ЦветФонаПодвала",Новый Цвет());
//        СтруктураКопируемыхСвойств.Вставить("ШрифтЗаголовка",Новый Шрифт());
//        СтруктураКопируемыхСвойств.Вставить("ШрифтПодвала",Новый Шрифт());
//
//        СтруктураОбработчиков.Вставить("ПриИзменении");
//        СтруктураОбработчиков.Вставить("НачалоВыбора");
//        СтруктураОбработчиков.Вставить("НачалоВыбораИзСписка");
//        СтруктураОбработчиков.Вставить("Очистка");
//        СтруктураОбработчиков.Вставить("Регулирование");
//        СтруктураОбработчиков.Вставить("Открытие");
//        СтруктураОбработчиков.Вставить("Создание");
//        СтруктураОбработчиков.Вставить("ОбработкаВыбора");
//        СтруктураОбработчиков.Вставить("ИзменениеТекстаРедактирования");
//        СтруктураОбработчиков.Вставить("АвтоПодбор");
//        СтруктураОбработчиков.Вставить("ОкончаниеВводаТекста");
//
//
//        Если ЭлементОбразец.Вид = ВидПоляФормы.ПолеВвода Тогда
//            СтруктураКопируемыхСвойств.Вставить("КнопкаВыбора",Неопределено);
//            СтруктураКопируемыхСвойств.Вставить("КнопкаВыпадающегоСписка",Неопределено);
//            СтруктураКопируемыхСвойств.Вставить("КнопкаОткрытия",Неопределено);
//            СтруктураКопируемыхСвойств.Вставить("КнопкаОчистки",Неопределено);
//            СтруктураКопируемыхСвойств.Вставить("КнопкаРегулирования",Неопределено);
//            СтруктураКопируемыхСвойств.Вставить("КнопкаСоздания",Неопределено);
//        Иначе
//            //Другие виды
//        КонецЕсли;

    }

}
